experiment-finetuned/all_finetuned/runs/damBreakWithObstacle/3/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1024;
        startFace       95232;
    }
    rightWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1024;
        startFace       96256;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1024;
        startFace       97280;
    }
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1024;
        startFace       98304;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          2048;
        startFace       99328;
    }
)

// ************************************************************************* //
