experiment-finetuned/all_finetuned/runs/damBreakWithObstacle/3/constant/dynamicMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   solidBody;

solidBody
{
    rotationAxis    (0 0 1);
    rotationOrigin  (0 0 0);
    omega           0;
}

// ************************************************************************* //