experiment-finetuned/all_finetuned/runs/damBreakWithObstacle/3/constant/physicalProperties.water
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phase1
{
    name        water;
    rho         1000;
}

phase2
{
    name        air;
    rho         1;
}

// ************************************************************************* //