experiment-finetuned/all_finetuned/runs/damBreakWithObstacle/3/system/topoSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    obstacleCell;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0.5 0.0 0.0) (0.6 0.4 1.0);
        }
    }

    {
        name    obstacleCell;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set obstacleCell;
        }
    }
);

// ************************************************************************* //